source/_posts/2015-12-22-using-git-as-magics.html
---
title: "一次 git 花样实战"
date: 2015-12-22
layout: post
categories: 
tags: 
published: true
comments: 
---

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">情况</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
周五在家工作了一天，向公司一个提交不频繁的库加了几个提交，但没有推送。其中一个提交，包含了一个 110M 的 cocos2d-x 静态库(是的，我知道不推荐提交这个，但我还是提交了^_-). 这个库托管在 Oschina 开源中国的 git 站, 周一的时候，我尝试推送这几个提交，发现 Oschina 有
100M 文件大小的限制，纳尼？
</p>

<p>
于是开始了 git 的花样实战. 
</p>

<p>
再说一遍, 情况大概是这样, master 分支，我的提交按时间顺序是 C1, C4, C5, 中间有 pull 下来的其他同事的提交以及 merge. C1 包含 110M 文件 110M.a.
</p>

<p>
<!-- more -->
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">备份</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
万事先备份.
</p>

<p>
git checkout -b masterbackup
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">获取服务器最新提交</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
git fetch
</p>

<p>
这样可以将本地的 origin/master 获取到服务器最新的提交.
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">重建 master 分支</h2>
<div class="outline-text-2" id="text-orgheadline4">
<p>
重建方式是, 删除本地 master, 并重新从 origin/master 创建 master
</p>

<p>
git branch -D master 
注意此时在 masterbackup 分支
</p>

<p>
git checkout -b master origin/master
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">重做 C1, 并修改提交</h2>
<div class="outline-text-2" id="text-orgheadline5">
<p>
git cherry-pick C1
</p>

<p>
注意此处得到的并不是 C1，应为 C1'
</p>

<p>
git rm 110M.a
</p>

<p>
删除了无法提交的文件
</p>

<p>
我这里采用了 split 的方法将其分割为几个小文件, 其他人只需要简单合并这几个文件即可
</p>

<p>
git add 110M.a_PART1 110M.a_PART2 110M.a_PART3
</p>

<p>
git commit &#x2013;amend
</p>

<p>
这个命令可以修改上次提交, 将已经加入到 stage 区的修改合并到上次提交(即 C1')
注意这个命令，万万不可再 push 后使用. (其实是不推荐 push 后使用)
</p>

<p>
这样我们就修复了这个无法提交的文件了.
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">同样重做 C4, C5</h2>
<div class="outline-text-2" id="text-orgheadline6">
<p>
git cherry-pick C4
</p>

<p>
git cherry-pick C5
</p>

<p>
没有什么好说的
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">推送, 清理战场</h2>
<div class="outline-text-2" id="text-orgheadline7">
<p>
git push origin master
</p>

<p>
git branch -D masterbackup
</p>

<p>
搞定!
</p>
</div>
</div>
